
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.settings_all["kong-openssl"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"977f510db198bc1b184a07302be619e13daea43a6ca2bbf21404cfd8dea8ee7a\"" -> "W/\"42cd7efd2f588654ae1bca7cf5c091fc4ce5c462a20a4d57287385a97144b832\""
        id                          = "kong-openssl"
        name                        = "kong-openssl"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["kong-runtime"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"e4e7f2a90b35ccc2dc7688e07f793e3897f6c318ecaaaf1bba465d5887f8ad53\"" -> "W/\"de08010a82fe8e7ef300823b46ffb42c7e7ef3f0258961a9036b60fd8f72748a\""
        id                          = "kong-runtime"
        name                        = "kong-runtime"
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository.settings_all["template-template"] has changed
  ~ resource "github_repository" "settings_all" {
      ~ etag                        = "W/\"95c501c4afd7280c163d997cf35748758057164097012f867f50fd75830adb03\"" -> "W/\"2f107a2302c3f916b51b405f9368a66459603f9a06e5e0982bfd8aeb846806fb\""
        id                          = "template-template"
        name                        = "template-template"
        # (33 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-build-images"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"7cc4b08b4dc4cbefeabfc98f17cad86f0e9ff6596d617bb8287ed285e4b53726\"" -> "W/\"793ddcfe0bbcac57a284a7a4ee317d4b049914fc201720b4aa68827a899f1ea8\""
        id          = "1252074"
        name        = "protect-main-branch-kong-build-images"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-openssl"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"8fddbe2e147d37c91d9d5f65eb74b7548ecfdb371b00c7ebb7556fdb07edab6b\"" -> "W/\"ea648da364094d6337dea9bf531a80d733c10ec3654b8368867fd0e566fede4b\""
        id          = "1259734"
        name        = "protect-main-branch-kong-openssl"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-github-release"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"4c4d855652c58ac50f231585c4e6b013415e047f5453b8de65088ccd4223595f\"" -> "W/\"589de106c708ffa9d9bc0e98dd158571ba25fda5b206805f2a2bc0bb06100abc\""
        id          = "1252075"
        name        = "protect-main-branch-template-1-github-release"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"60601d979169cb8716e4278be23dd7caadf1a3fced0e5fdf2ae8fb88ec76bd37\"" -> "W/\"e5850fb5d8b9d330732a8fba94a67b7751ecb969e1c065468c3f12aa3f0db82c\""
        id          = "1252077"
        name        = "protect-main-branch-template-1-terraform"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["template-template"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"ce8a0ea028a1deb47fe3210f4efc32e034f2ad23b78f019d4a648b7609298412\"" -> "W/\"105b8d2671009b1239c8c17cdbe7ac0159ed6808a29c8847b7df46bf6f5e9895\""
        id          = "1252076"
        name        = "protect-main-branch-template-template"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_all" {
      ~ etag        = "W/\"ad0b07145b27f7ae51e56eed86768982a238baa2f728ac93e12a67df9dc7e8f7\"" -> "W/\"92529d087701649be6ea1ce90a2e1fdc2ccb4c3963bfedfbf026f6276ac50da7\""
        id          = "1252078"
        name        = "protect-main-branch-terraform-github"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["template-1-terraform"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"dd7cacd6b31405aab9296573b49c17e1afc9b22eb0c061f0a9aafb7f297f2560\"" -> "W/\"d1bac77a2c2a774df0de4ac589abcd218a4579bdacd108bfded0bdccc0d5a347\""
        id          = "1252079"
        name        = "protect-main-branch-terraform-template-1-terraform"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_terraform["terraform-github"] has changed
  ~ resource "github_repository_ruleset" "pr_ruleset_terraform" {
      ~ etag        = "W/\"54608d62c48323d7c6057833e9746b5bfd1b7fb069e707fcf49c03671048cd47\"" -> "W/\"6e2f822873dea18aa11136ed820a584dabec3fefd84ae3189815f08dfb7ecafe\""
        id          = "1252080"
        name        = "protect-main-branch-terraform-terraform-github"
        # (5 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.settings_all["kong-runtime"] will be updated in-place
  ~ resource "github_repository" "settings_all" {
        id                          = "kong-runtime"
        name                        = "kong-runtime"
      - vulnerability_alerts        = true -> null
        # (32 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # github_repository_ruleset.pr_ruleset_all["kong-runtime"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_all" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-kong-runtime"
      + node_id     = (known after apply)
      + repository  = "kong-runtime"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-build-images"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-kong-kong-build-images"
      + node_id     = (known after apply)
      + repository  = "kong-build-images"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "done"
                  + integration_id = 0
                }
              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-openssl"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-kong-kong-openssl"
      + node_id     = (known after apply)
      + repository  = "kong-openssl"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "done"
                  + integration_id = 0
                }
              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

  # github_repository_ruleset.pr_ruleset_kong["kong-runtime"] will be created
  + resource "github_repository_ruleset" "pr_ruleset_kong" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "protect-main-branch-kong-kong-runtime"
      + node_id     = (known after apply)
      + repository  = "kong-runtime"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + update_allows_fetch_and_merge = false

          + required_status_checks {
              + strict_required_status_checks_policy = true

              + required_check {
                  + context        = "done"
                  + integration_id = 0
                }
              + required_check {
                  + context        = "pre-commit"
                  + integration_id = 0
                }
            }
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

<!-- Sticky Pull Request Commentterraform-plan -->